## 175. COMBINE TWO TABLES
Write a solution to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

In [ ]:
SELECT firstName,
       lastName,
       city,
       state
FROM Person a
LEFT JOIN Address b
ON a.personId = b.personId

## 176. Second Highest Salary
Write a solution to find the second highest distinct salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

In [ ]:
SELECT IFNULL(
    (SELECT DISTINCT salary
    FROM Employee
    ORDER BY salary DESC
    LIMIT 1 OFFSET 1), NULL) AS SecondHighestSalary

## 177. Nth Highest Salary
Write a solution to find the nth highest distinct salary from the Employee table. If there are less than n distinct salaries, return null.

In [ ]:
CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
    DECLARE M INT;
    SET M = N - 1;
    
  RETURN (
     # Write your MySQL query statement below.
    SELECT DISTINCT salary
    FROM Employee
    ORDER BY salary DESC
    LIMIT 1 OFFSET M
  );
END

## 178. Rank Scores
Write a solution to find the rank of the scores. The ranking should be calculated according to the following rules:

* The scores should be ranked from the highest to the lowest.
* If there is a tie between two scores, both should have the same ranking.
* After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.
  
Return the result table ordered by score in descending order.

In [ ]:
SELECT
    score,
    DENSE_RANK() OVER (ORDER BY score DESC) AS 'rank'
FROM Scores

## 180. Consecutive Numbers
Find all numbers that appear at least three times consecutively.

Return the result table in any order.

In [ ]:
SELECT DISTINCT num AS ConsecutiveNums
FROM (
    SELECT num,
           LEAD(num, 1) OVER (ORDER BY id) AS next_1,
           LEAD(num, 2) OVER (ORDER BY id) AS next_2
    FROM Logs
) AS temp
WHERE num = next_1 AND num = next_2

## 181. Employees Earning More Than Their Managers
Write a solution to find the employees who earn more than their managers.

Return the result table in any order.

In [ ]:
SELECT e.name AS Employee
FROM Employee e
JOIN Employee m
ON e.managerId = m.id
WHERE e.salary > m.salary

## 182. Duplicate Emails
Write a solution to report all the duplicate emails. Note that it's guaranteed that the email field is not NULL.

Return the result table in any order.

In [ ]:
SELECT email AS Email
FROM Person
GROUP BY email
HAVING COUNT(*) > 1

## 183. Customers Who Never Order
Write a solution to find all customers who never order anything.

Return the result table in any order.

In [ ]:
SELECT c.name AS Customers
FROM Customers c
LEFT JOIN Orders o 
ON c.id = o.customerId
WHERE o.customerId is NULL

## 184. Department Highest Salary
Write a solution to find employees who have the highest salary in each of the departments.

Return the result table in any order.

In [ ]:
SELECT 
    d.name AS Department,
    e.name AS Employee,
    e.salary AS Salary
FROM Employee e
JOIN Department d
ON e.departmentId = d.id
WHERE (e.salary, e.departmentId) IN (
        SELECT MAX(salary), departmentId
        FROM Employee 
        GROUP BY departmentId)

## 626. Exchange Seats
Write a solution to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

Return the result table ordered by id in ascending order.

In [ ]:
SELECT
    CASE
        WHEN id % 2 = 1 AND id = (SELECT COUNT(*) FROM Seat) THEN id
        WHEN id % 2 = 1 THEN id + 1
        ELSE id - 1
    END AS id,
    student
FROM Seat
ORDER BY id ASC